.
i
a
called
friend
have
,
who
at
lives
baby
has
mum
go
is
often
to
very
's
oliver
cricket
play
and
door
man
next
rounders
dad
duck
get
some
{
}
are
ducks
eggs
from
the
home
red
white
put
went
with
under
collects
sea
he
making
of
out
shed
wood
for
he
made
swing
big
garden
lots
collect
parents
shells
small
which
hang
net
on
they
wall
house
their
by
hillside
in
live
overlooking
by
property
used
was
gun
three
grounds
all
flat
runs
terrace
way
across
below
gardens
it
line
railway
ferry
said
that
built
dead
dying
who
workers
dry
into
thrown
were
then
well
covered
granite
large
over
also
lonely
poor
seen
spirits
these
owner
previous
if
them
told
comfort
found
rest
there
stay
welcome
adams
club
lady
run
lesley
smithy
watson
at
snooker
table
we
football
hockey
mini
tennis
badminton
chess
down
lovely
weather
would
beach
th
when
the
games
inside
mondays
starts
half
past
six
until
our
shop
tuck
bags
buy
can
costing
crisps
bars
chocolate
church
each
hall
as
crops
other
such
it
fruit
seems
slowly
'
tom
ltd.
n
trade
after
expanding
having
new
rapidly
january
management
this
competition
increase
weak
due
lack
amount
grow
taken
time
2
:
crop
fair
years
4-5
productive
popular
france
grown
world
america
italy
spain
around
especially
northern
in
queen
island
representative
these
armed
consist
forces
brigade
comprising
pupils
college
elizabeth
staff
d
boys
public
school
square
there
move
present
guernsey
government
part
britain
great
not
but
as
kingdom
united
british
its
head
own
state
government
virtually
local
comprises
locally
(
elected
members
)
sits
court
port
royal
where
passes
uk
laws
not
book
gives
council
although
block
does
mostly
this
east
coast
narrow
strip
island
harbour
includes
basic
needs
serving
tourist
transport
boasts
two
yacht
construction
third
entrance
port
castle
eight
hundred
old
year
cornet
roman
whilst
recently
rescued
considerable
mouth
historical
importance
employment
main
source
area
club
yacht
fishermen
facilities
provides
recreational
nearby
place
attracts
interest
many
visitors
during
wet
total
firm
worldwide
carrying
comes
mainly
oil
tanker
north
30
boat
hours
takes
6
unload
they
flow
pipes
turn
road
tanks
million
seven
take
lorries
need
first
puts
ticket
few
how
much
see
7
minutes
7000
load
use
central
heating
diesel
greenhouses
channel
exports
islands
in
morning
up
breakfast
my
cornflakes
cup
jam
toast
then
coffee
car
me
lesson
maths
english
like
playing
swimming
adventure
might
playtime
reading
12
lunch
.in
field
sunny
afternoon
do
drawing
or
stories
home.i
soon
watch
kick
my
climbing
favourite
frame
wooden
knight
programmes
bed
aged
winter
busiest
st
biggest
260
foot
ship
long
parts
north
side
south
on
coal
sand
timber
heavy
goes
pipeline
underground
power
straight
4
gas
petrol
silos
bricks
bring
ships
holland
fertiliser
been
safety
fuel
any
case
an
cause
explosion
fire
may
recently
pipe
station
harbour
throughout
now
twenty
annual
per
annum
employ
maximum
people
fifteen
one
denmark
export
except
business
pumps
conversion
town
pressure
test
completely
practice
separate
five
joined
together
board
be
should
suggested
gas
connected
both
low
tide
close
owned
privately
open
build
peter
st.
pictures
show
larger
than
grass
top
gulls
hill
inhabited
rabbits
dairy
farm
cows
herds
farmers
about
cattle
eighty
give
forty
litres
day
milk
most
daily
exported
bulls
calves
heifers
acres
good
pasture
reach
within
another
11
summer
cut
silage
winter
hay
imported
straw
100,000
common
pit
visited
looking
tourists
''
``
dream
;
if
tenant
asked
design
anywhere
chose
beaches
best
most
shell
being
famous
200
different
north-east
fine
pretty
scenery
cliff
grassy
walks
other
attractions
fishing
walking
birds
flowers
500
abound
insects
extend
for
administered
all
woods
family
involved
running
tourism
upkeep
farming
covers
population
range
whole
essential
resident
services
months
care
extra
sixty
visit
every
no
usually
either
problem
permanent
seasonal
after
return
clubs
riding
more
ones
recent
1984
beginning
formed
10
15
riding
ride
one
sunday
held
star
sister
organisation
children
started
age
manse
youth
group
wednesday
evening
older
she
above
younger
6.00
fridays
lodge
hold
mandy
fund
pubs
disabled
helps
fund
because
helpful
dentist
pay
trips
stamps
saint
schools
education
help
sales
dances
evenings
social
charities
money
raise
blue
others
discos
regular
9pm
saturdays
tuesdays
pool
space
tables
boxes
when
raised
christine
ambulance
off
west
therefore
general
public
total
160
cliffs
surrounded
landing
sheltered
jacob
known
70
land
available
working
cottages
servants
access
fully
helicopter
separated
stretch
water
telephone
between
islands
link
gap
shops
compared
jersey
what
food
general
stores
1
bakery
combined
grocery
paper
health
bread
sells
mr
jackson
john
his
owns
selling
gifts
shoes
toys
butchers
only
apart
we
office
post
equipment
gardening
little
goods
mon
away
situated
street
hand
jewellery
chemist
gift
gear
photographic
fashionable
etc
hires
tea
another
videos
cave
art
craft
shop
fairly
anything
rather
mill
refreshments
sweets
drinks
newest
1985
opened
clothes
!
station
spare
tractors
system
rules
decided
court
senior
room
school
so
three
times
meetings
spring
gathering
parliament
chosen
important
decisions
improvements
discussed
agreed
courts
buildings
standing
houses
stone
asbestos
to
you
landowner
permission
amenities
committee
whether
things
lived
prove
must
your
high
some
storeys
retired
enjoy
peace
locals
quiet
flats
let
night
spot
la
end
here
drink
just
meal
friends
nights
week
dancers
singer
costs
less
â£1.00
350
400
disco
light
duran
latest
records
dug
played
bay
number
pits
conservation
de
dig
building
industry
because
needed
extraction
finished
restored
will
plan
empty
refuse
tips
difficult
pollution
rid
behind
fertile
future
sloping
earliest
early
each
potatoes
produce
slopes
nine
ten
market
reason
same
soil
face
seed
sown
almost
harvested
?
why
workshop
ago
thirty
countries
australia
japan
attraction
set
commercial
venture
formal
means
demonstration
work
you
could
craftsmen
name
plate
carved
furniture
piece
special
items
exotic
hard
types
woods
cafe
hot
premises
better
cool
cream
ice
park
van
giant
otherwise
jack
long
generations
fodder
leaves
consumption
human
sticks
tomato
person
carry
using
vegetable
now
even
cabbage
giant
seeds
follow
simple
methods
bicycle
buses
hire
taxis
tours
train
left
.this
near
quarry
eastern
service
boats
round
by
far
route
brings
ever
supplies
vital
product
always
answer
august
aside
week
designed
attract
fun
ways
possibly
organise
stalls
events
prepare
apples
_
miss
race
plays
odd
talent
procession
parties
great
thing
variety
size
t.v
did
survey
habits
viewing
class
record
watched
least
5
front
hrs
spent
24
mins
average
worked
drama
followed
series
every
had
colour
bedroom
27
recorder
video
14
computer
micro
household
8
boy
cars
caravan
watching
everyone
olds
saturday
a
classes
dancing
girls
meet
shopping
look
rounds
watching
pack
television
amongst
magazine
lasts
programme
commonly
tape
going
sleep
usual
ending
sections
centre
cases
actually
sale
customers
section
choose
elsewhere
belts
leather
wire
copper
makes
stained
butterflies
glass
shape
various
coloured
pieces
she
edges
strips
four
blowing
engaged
animal
shapes
largest
village
office
post
books
nearby
hairdressers
newsagents
groceries
ladies
stores
able
community
organisations
hall
next
parish
administration
welfare
centre
entertainment
jumble
meeting
farmer
inn
ferns
grasses
trees
east
filled
meadows
along
buttercups
grazing
length
valley
following
stream
original
pond
before
mill
1700
barn
harvest
restaurant
outside
sit
setting
sun
talk
produced
first
tower
and
schools
caves
from
bar
stepped
path
through
smugglers
order
entering
although
evidence
existed
got
no
knows
sure
true
anniversary
celebrate
legend
remains
story
world
two
war
parishioners
grand
party
11th
may
recreation
organised
authorities
provided
chicken
excellent
salad
during
beef
ham
morris
acts
karate
arts
festival
everyone
thought
appropriate
enjoyable
occasion
mills
also
1962
knocked
make
reservoir
badly
sited
burnt
1961
given
stood
park
edge
estate
housing
estate
3
paul
second
still
war
carried
four
squares
surveyed
researched
topics
bishop
c
thanks
extended
marketing
milk
edwards
evening
form
pages
sixth
rebecca
3rd
joint
juniors
effort
-
mrs
staff
p
b
french
army
baron
led
battle
last
represents
attempts
fought
landed
sides
country
towards
came
marked
plaque
point
rocky
view
corner
greatest
rock
shingle
extreme
13
excess
metres
slightly
occur
spring
tides
however
several
possible
walk
kilometres
tower
mark
rises
covering
rocks
surrounds
drowned
here
someone
care
take
contains
areas
dominated
medieval
base
about
km
village
19th
century
golf
adjoining
links
coastal
entirely
inland
arable
hillsides
reputation
steep
producing
principal
institute
women
second
7.30
tuesday
month
p.m.
methodist
meets
jean
mrs.
williams
farm
talks
us
first
aid
subjects
decorating
egg
poem
w.i
dinner
song
written
william
poet
22
enter
cornwall
competitions
show
too
travel
&
17
branch
page
2nd
october
1970
meetings
chapel
committee
20
membership
monday
pounds
women
institute
junior
membership
starting
based
movement
speaker
subject
fellowship
wi
support
charity
concerns
closure
rail
tax
entries
dairy
farming
highly
once
prize
60
intensive
milking
plus
followers
kept
hectare
earlier
farms
changed
pig
production
eec
economic
quota
crops
potatoes
markets
sent
bulk
factory
potato
activity
horticulture
minor
match
isles
tend
history
little
cables
laid
1870
later
transferred
tunnel
closed
became
training
tunnels
college
offers
finest
international
40
cater
classrooms
150
student
students
accomodation
took
works
electricity
grinding
wheat
saw
questions
enjoyed
thank
performed
talked
arrived
finally
tube
beautiful
healthy
and
jimmy
hospital
birth
ended
wait
worth
hour
labour
progress
inch
moment
arrival
hopes
problems
already
sam
taking
back
our
villages
coastline
mount
peninsula
say
clearly
rain
quarry
sight
mine
operating
yards
promenade
join
rugby
team
squash
guides
brownies
legion
adults
football
moor
groups
theatre
de
players
peters
bowls
bait
string
disadvantage
keep
n't
places
but
lorry
fork
lift
truck
co
100
emma
expensive
old.the
heart
beat
operation
time.the
worst
nurses
love
ward
peak
season
casualty
hospital
ambulances
send
high
unit
stands
dangerous
disease
35
dock
depends
've
never
busy
instead
moving
floating
men
're
vessel
pumped
longest
workmen
repaired
there.the
materials
metal
plates
manned
automatic
decision
brought
collecting
higher
halt
process
dad
believed
financial
won
felt
himself
happen
meant
losing
paying
profits
discussion
final
not
enough
generally
hamlet
consists
happy
her
life
power
overhead
breaks
constantly
changing
burning
cheaper
latter
her
originally
farmer
rearing
young
sold
added
form
attractive
bungalow
hay
distance
professional
plymouth
architect
barn
lot
quite
spend
yorkshire
moved
fired
pottery
style
social
visiting
photography
done
deep
cold
guest
opposite
chapel
area
information
on
the
this
was
studio
children
collected
form
of
primary
school
st.
teacher
their
under
all
helped
but
following
some
way
were
involved
more
computer
age
name
round
mark
richard
dairy
ooo
produces
bottles
delivered
fleet
floats
stored
butter
tons
l
ton
products
primrose
tesco
firms
marks
find
dates
farmhouse
since
chimney
stack
date
listed
thatched
guide
approximately
mixed
l5
cow
however
currently
23
lord
belongs
county
deal
elsewhere
complete
concerned
named
names
numbered
fields
animals
instance
turnip
2o
allowed
fact
kale
protein
only
employed
twice
level
parlour
shooting
pheasant
sport
reared
kind
confined
forty
detached
semi
twelve
terraced
newer
bungalows
estates
outskirts
factories
russell
wife
secretary
his
dating
machinery
replaced
sixties
cost
machines
diamond
upstairs
nets
walls
rooms
many
crab
fish
pot
sports
occasionally
down
call
badges
sell
guns
sorts
bed
guest
houses
breakfast
holiday
hotels
eating
including
chip
trouble
parking
nice
atmosphere
sometimes
'm
afraid
activities
indoor
outdoor
putting
diving
miles
north-west
accommodate
grew
miners
irish
housed
old
tree
established
mining
establishment
outlet
today
cornish
mile
originated
settlement
tin
pub
arms
private
paid
bills
rents
supplied
itself
green
claimed
former
outing
visits
dance
figure
significance
unknown
cricket
founded
1873
adjacent
fields
meadow
1929
originally
smaller
pavilion
served
gate
immediately
1931
lady
company
purchased
included
sum
over
surface
appreciated
division
junior
mining
day
league
people
vintage
outside
library
statue
richard
invented
born
62
died
steam
air
defence
ministry
upper
air
measures
speed
temperature
wind
radio
direction
launched
automatically
control
information
seventy
flight
height
reaches
balloon
collected
onto
passed
weather
interesting
features
include
radius
ideal
ample
accommodation
varied
converted
camp
homes
sites
sandy
surfing
safe
south
themselves
path
spectacular
energetic
views
cove
point
via
additional
july
weeks
proportion
though
daughters
son
travelled
suffolk
stayed
outbuildings
living
chalets
bathroom
bedrooms
kitchen
food
bought
days
bathing
along
stretches
walked
lunches
picnic
ate
meals
occasionally
snow
decide
picking
rhyme
shall
asks
perform
type
snow
required
becomes
judged
legs
bottom
leg
touch
full
position
police
county
primary
nursery
education
scheme
says
schemes
come
roll
whom
catchment
full-time
teachers
headteacher
teaches
an
ancillary
infants
comprehensive
museum
formerly
leave
meat
1949
martin
wives
wished
everyday
objects
display
throwing
soon
proved
its
hill
china
clay
90
street
streets
of
16
shoe
stationery
iron
chemists
piano
purchase
suit
encouraged
societies
banks
choice
dental
surgeries
chiropodist
optician
arcade
1983
giving
adds
band
town
band
concerts
gave
1897
onwards
serious
championship
1960
brass
national
championships
albert
musical
current
director
1976
greater
pushed
heights
performing
1982
majority
outstanding
pool
properties
term
engine
winding
mine
1300
ore
1887
brothers
shaft
earth
movements
today
1941
electric
harvey
1892
co.
1854
saved
engineering
66
according
leisure
bbc
channel
anyone
hardly
day.the
sue
keeps
tennis
netball
shinty
pastimes
breeding
benefit
gained
pastime
sense
rope
skipping
bells
ivy
plastic
holes
hole
marbles
pull
stick
without
game
object
bat
ball
catch
easy
hit
catchers
job
caught
stand
wide
ends
fast
before
start
counts
hide
while
spotted
seeker
seal
holding
pools
holds
seals
hopefully
isolation
injured
jones
sanctuary
naval
sea
those
fire
crew
roughly
grid
no
enclosure
kings
warning
aircraft
want
grid
ref
meaning
word
preserved
chamber
passage
.the
leading
yet
storage
place
worship
their
hiding
slabs
stones
cross
bronze
burial
powers
think
several
babies
mothers
9
against
illnesses
yard
huge
lines
triangular
offering
children
stoves
bench
desks
seats
exercise
wrote
detailed
painted
seldom
maps
cane
teacher
spinning
tig
tops
rolling
pellets
sycamore
write
brown
interview
sports
chairman
secretary
president
entertainment
bar
exchange
jobs
1973
blue
colours
yellow
teams
employer
single
tourist
self-employed
nurseries
plants
specialising
cottage
industries
example
turning
towns
unemployed
doctors
attend
registered
doctors
health
visitors
mums
sometimes
typical
lies
moorland
rough
cultivated
valleys
fed
numerous
streams
surrounding
ground
alice
white
serve
community
rural
village.it
1875
18th
infant
120
assistant
sends
secondary
boundary
just
further
pit
centres
september
described
natural
.it
know
workings
death
1\
2000
relics
derelict
spoil
track
railways
ditches
drainage
agricultural
commute
churches
touring
attic
adding
occupy
gain
somewhere
convenient
advantage
feels
housing
limited
modern
traffic
28
furthest
year.the
easter
repair
decorate
maintain
rides
opens
tested
greatly
caravans
travelling
land
particular
self
considerably
varies
flower
females
casual
vary
contractor
haulage
18
lane
carries
feed
grain
merchants
fishing
quay
motor
mechanic
occupations
carpenter
hairdresser
author
associated
labour
relations
caravan
camping
catering
providing
vegetables
sailing
windsurfing
woodland
opportunity
fauna
flora
forms
inhabitants
ranging
predominantly
mixture
processing
quarries
e.g
blocks
partly
disused
major
trading
shortly
site
mental
project
involves
eleven
pumping
tries
bins
lighting
litter
maintains
much
footpaths
conditions
council
parish
roads
letters
helped
association
newly
residents
wants
ca
something
store
couples
married
seem
shopkeepers
handy
saves
villagers
corner
bus
fares
everything
bread
item
accept
orders
deliver
pensioners
defence
attack
papers
else
unusual
watering
referred
wealth
era
gone
engines
ruined
chimneys
heaps
shafts
downs
hoped
period
prosperity
reclamation
planted
developed
industrial
units
farmland
at
end
council
site
to
are
number
there
for
them
used
from
also
club
is
industry
light
firm
windows
building
which
changing
originally
room
closed
later
now
part
buildings
as
present
an
industrial
opposite
concrete
works
old
's
dance
folk
carnival
headmaster
doing
faces
him
yes
list
models
shows
lake
appointment
marks
becoming
get
set
depending
adult
cover
offered
camp
mirror
canoeing
hunts
treasure
raising
art
craft
compiled
ian
james
jonathan
norton
lee
robert
davies
matthew
smith
ann
debbie
jason
julie
nicholas
stephen
assistance
mary
suzanne
barbara
head
councillors
looks
paths
opinions
pass
planning
rebuilding
eroded
steps
fitting
built.the
cutting
regularly
parked
results
%
67
step
cats
dogs
goldfish
older
9.00
pm
tv
young
ones
8.30pm
liked
farther
holidays
beans
chinese
voted
experiments
0
37
yes
smoke
26
violence
32
aspects
c.
class
e
s
completed
d-block
bowling
road
1950
association
clubs
rugby
wherever
1872
strongly
oldest
wake
breakfast.i
new
mum
athletic
probably
industries
book
drilling
rig
project
drill
feet
thousands
right
jane
grid
operated
levels
draining
rock
deep
rigs
drills
blast
blasting
flood
black
pitch
hands
pick
cage
ladders
wheel
child
gold
gold
real
8.00
am
dog
cards
computer
idea
getting
1000
o'clock
disco
p.m
constable
police
card
holders
picture
doors
resort
pair
personal
radio
helmet
patrol
wears
cap
wear
jacket
short
sleeves
drugs
wimpey
foundations
concrete
builders
it.the
roof
tile
lawn
normally
1966
semi-
requires
neighbours
clean
cook
horses
stables
treats
trekking
enjoys
obviously
pets
good
contractors
rare
severe
spell
enterprise
undertaken
grows
mr.
polythene
dozen
part-time
lettuce
tomatoes
rising
chemicals
e.e.c
mean
regulations
controlled
quality
supply
minimum
seaside
crowded
cafes
teas
topped
boating
golden
pony
gliding
golf
hills
badminton
table
squash
walking
country
music
water
western
fishing
wave
shore
boom
swimming
fit
clear
catches
ing
reserve
species
moths
spots
wing
identify
large
butterfly
pale
bright
green
whilst
heathland
wildlife
brightly
flock
kestrel
pigeon
nest
rose
gulls
herring
wings
rarely
nesting
martins
sand
nests
pole
crow
flew
river
estuary
floods
creating
marshes
gently
landscape
winds
created
trapped
shallow
drain
dunes
growing
carefully
read
10.40
certain
.there
12.00
2.30
break
3.45
house
grove
wood
church
road
55
breeze
street
house.the
five
fields
mr
electric
builder
longer
history
local
1086
domesday
entry
cottage
pump
exists
septic
1st
henry
missionary
bible
supposed
ghost
haunted
eight
playing
telephones
10p
counter
parcels
stamp
usually
arrives
letter
emergency
communication
emergency
50
legal
enabling
7am
8am
homework
weekends
till
late
listen
tapes
pocket
contrast
childhood
difficulties
experienced
families
teenage
expanded
precinct
appears
summer
replace
grammar
modern
schools
computers
experience
training
teachers
leavers
unable
appear
strict
action
industrial
unemployment
government
restrictions
caused
bull
cattle
store
rear
creates
aberdeen
angus
hereford
friesian
charolais
simmental
numbers
june
capacity
indicate
..
...
300
250
1400
calves
900
sheep
pigs
â£1
commission
representing
carrick
councils
district
city
secluded
gardens
remembrance
1956
serves
nearest
city
sheep
forestry
commission
vicarage
sizes
holdings
crosses
amenities
lanes
maintained
hedges
allen
wooded
fewer
650
acre
scattered
tied
hoping
employs
worker
scheme
weekly
pays
â£10
feel
isolated
230
barton
surrey
ago.the
brook
2,000
stocked
trout
commercially
viable
expense
owners
feeling
shetland
keeping
ponies
chickens
geese
reported
midnight
140
worthwhile
operate
contain
agents
catching
crabs
lobsters
shellfish
higher
profit
nestling
drive
authority
west
uses
fly
4000
churchyard
rainbow
largely
rebuilt
norman
cross
font
distinct
landmark
villas
pier
shelters
tiny
gravel
gull
rock
bay
sailing
fill
temporary
clubhouse
similar
races
beginners
tuition
waters
suited
beach
boards
hired
powell
simon
samantha
victoria
salmon
roberts
reed
kevin
claire
neil
19
20th
1980
prince
57
medical
charge
nurse
25
trophies
muddy
river
moored
mud
stuck
headed
curlews
pigeons
occasional
ash
beech
oak
blackthorn
bank
until
commuter
antiques
retire
garage
repairs
hair
supplement
depot
grave
nearly
cemetery
vicar
minor
horse
rocking
slide
swings
frames
raf
quarters
1930
leader
previously
rented
tenants
office
113
printer
beer
ceased
burn
600
barrels
crossroads
congestion
occurred
particularly
indian
queens
interviewed
360
driven
battery
years.the
1959
6000
distributed
area.the
steel
near
discovered
1100
tankers
building.the
citizens
draw
pensions
week.the
closes
snacks
playgroup
friday
mornings
9.15
helpers
painting
balls
lego
biscuits
seemed
funds
stall
â£20
raises
knitting
appeal
news
watches
farmers
outings
weekend
belong
pensioner
gets
active
marshall
21
years.he
thinks
95
delivers
alternate
burn
double
60p
become
conscious
5.30
a.m
a.m.
winter.the
vans
easier
harder
owning
hotel
75
villa
feature
hotel
restaurant
provide
facilities
films
featured
listening
own
standard
prices
board
suite
family
foreign
farm
house
traditional
garage
hotel
tractors
david
international
ferguson
massey
bale
corn
tractor
disk
1200
plough
weight
fertilizer
wall
sprayer
transport
box
major
mower
combine
cement
mixer
roller
driver
tractor
begins
ready
receive
manager
harvest
pulling
trailer
finishing
finishes
receives
spite
child
time
sarah
lollipop
assembly
science
indoors
sundays
afternoons
tidy
midway
end
land
railway
road.the
stations
respectively
flows
developing
passing
manufactured
quarried
dads
bikes
mend
motor
teenagers
youth
b.m.x
earn
weeding
lucky
groom
darts
racing
trials
seek
batting
hide
infant
seeking
posts
hits
score
hobbies
elderly
posters
aeroplanes
arranging
flying
w.i.
rainbow
asking
reasons
cities
noisy
pace
climate
ground
thomas
roundabout
goal
field
shrubs
camera
paraffin
film
tobacco
custom
mr.and
window
bypass
wanted
began
behind
joining
1986
shown
surgery
really
sick
away.the
rees
dentist
teeth
treatment
wanting
hospitals
accident
patients
nurse
bored
improved
contact
2/3
actual
pre
scale
architectural
focus
appearance
core
convenience
1963
sewage
decreased
central
spar
1975
gardens
have
long
right
hill
lane
mill
smaller
until
view
potatoes
few
had
most
chickens
pigs
trees
two
usually
kept
one
sale
cow
family
change
domestic
life
since
has
self
cut
grass
production
limited
converted
or
other
been
sold
with
sea
main
former
port
farms
study
daily
only
served
bus
private
goods
needs
centre
roads
shopping
very
services
areas
sheep
secondary
8.25
stop
bell
rings
porch
classroom
desk
maths
10.30
bag
playground
rung
arithmetic
register
dinners
joins
language
creative
cooked
sandwiches
geography
3.30
concern
decline
loss
causing
threat
opening
suggest
opposition
infrequent
possibility
primary
1900
toilets
soccer
coming
improve
planned
1.00
lunch
quite
packed
obtained
extends
3000
farms.the
gardeners
castle
2500
grandfather
charles
distinguished
gardener
varieties
bear
anne
destroyed
playgrounds
lawns
beyond
haven
hamlets
outlying
transfer
comprehensive
approximately
clustered
china
clay
farming
sources
resulting
applied
electrical
suppliers
share
1883
parallel
holidaymakers
nature
amusement
arcades
cinemas
countryside
hedgerows
bluebells
primroses
farmed
systems
h.
group
varying
speakers
christmas
party
pensioners
pavements
placed
signs
playgroup
existence
fees
service
leads
roast
lamb
t.v.
sings
gospel
choir
bath
shower
within
supper
exposed
bullocks
boundaries
goats
pigs
balers
mowers
discs
rollers
45
divided
lunchtime
remainder
games
4th
science
lessons
fortnightly
highest
700
rich
god
description
visible
prominent
western
-the
stone
deals
gather
since
gate
andrews
joanna
lisa
zoe
darren
michael
day
michelle
bonnie
harris
anna
bruce
coastguard
trust
bird
nature
preservation
society
jump
sugar
calls
wash
dried
socks
shirt
trousers
registration
minute
picks
bedtime
coach
leased
rail
drivers
mechanics
influx
makers
passengers
occurs
study
waste
slurry
quickly
alder
willow
wetland
vegetation
heath
heathers
broom
gorse
natural
completion
know
words
derived
translation
mice
grey
grey
moor
gardening
monthly
organises
bingo
whist
arrange
failed
camps
organising
p.t.a
fair
behalf
school.the
highlights
festivals
choirs
carol
fund-raising
situation
fear
further
express
spread
nuclear
effect
clearance
affect
forests
resources
growth
unemployment
worry
cancer
kinds
tit
woodpecker
buzzards
kestrels
sights
bridge
wagtail
dippers
martins
swallows
crow
magpies
crows
are
predators
crazy
rink
skating
bay
golf
nigel
edward
tony
wales
donated
figures
parishes
leisure
course
docks
dirty
communities
maybe
sea-level
gentle
flatter
hilly
mayor
king
plant
purple
bedding
watered
85
barley
turnips
basis
yearly
livestock
pedigree
brownies
guides
scouts
adventure
25p
coke
normal
hockey
9.30
gary
sets
tower
witch
in.the
mound
fetes
employment
gavin
bit
take-away
driving
drove
catering
self
static
ocean
site
remain
caters
arthur
false
widely
begin
expected
exciting
facts
draws
magnificent
heritage
chairman
whose
april
fourteenth
manor
1844
fifty
receiving
31st
adults
lower
fattening
80
fattened
consisting
herd
intensively
cereal
ewe
cheviot
machinery
trout
precision
valley
constructed
dam
ponds
containing
correct
restaurants
8000
pound
price
looked
nowadays
fathers
brothers
sons
market
cabbages
soft
mink
rob
turns
lets
washes
stuff
milked
waiting
eat
again
m.
1884
between
thousand
restore
heat
congregation
communion
prayer
fashioned
rev
conducted
difficulty
finding
priests
organ
coniferous
douglas
sitka
spruce
forestry
quarter
felled
tall
chipboard
pulp
fencing
pleasant
forest
riverside
abandoned
taxi
work.the
blows
sprays
years.it
thier
library
hat
harold
blacksmith
hunt
tried
it.there
body
brush
comb
curry
stable
mills
helen
rubber
brother
sisters
clare
louise
brian
roger
diana
master
boys
journey
9:00
p.e.
geography
history
reading
infants
juniors
games
home
played
1,2,3
chain
groups
pop
tig
granny
believe
granted
responsibility
historic
ancient
castles
farmhouses
cotton
details
address
phone
contract
bell
109
ranger
twin
faster
continues
alistair
falls
dealt
ecology
devon
farming.the
jenny
stopped
george
lighthouse
fog
picked
cave
strawberry
22nd
lucy
trip
ladies
crashed
ward
both
offer
hostel
rent
prices
extensive
europe
collections
thursday
amounts
provisions
coaches
reading
fortnight
stops
riding
walking
rough
shooting
shoots
copy
charlie
apple
oak
29th
wardens
visitor
downs
bronze
mounds
cast
disposal
result
unspoilt
excavated
fresh
feeds
aerial
changes
enable
consisted
barns
row
southern
removed
through
facing
remained
saxon
perch
light
windows
tells
with
slates
sided
steeply
reverend
mark
dominant
hectares
supports
ewes
stock
force
daily
adequate
purpose
implements
specialised
tasks
electricity
reached
responsible
wild
aids
conservation
hikers
rugged
trail
bounded
cars
change
exception
notable
dish
signals
dominate
scientific
24th
march
contribute
christian
hymn
cakes
room
adult
disco
chapels
schoolchildren
wonderful
daffodils
violets
bells
daisies
heather
spraying
loved
bulbs
roots
clumps
architecture
efforts
predominately
altered
reasonable
standard
unchanged
thick
comfortable
storey
flooded
popularity
rise
photographs
blackbird
gull
buzzard
curlew
wren
heron
herring
sparrow
kestrel
lesser
ringed
magpie
meadow
thrush
swan
catcher
oyster
partridge
pied
reed
dove
robin
warbler
page
hawk
swallow
owl
tawny
fish
off
types
cod
cuckoo
haddock
mackerel
lobster
skate
fish
salmon
smooth
sole
orange
tip
brown
plateau
w
require
scarce
roofs
slate
tiled
none
15th
1860
53
answered
showed
mentioned
girls
hopscotch
bicycles
daniel
bite
struggle
float
lost
eels
frozen
must
places
block
doctor
however
post
people
interesting
care
village
different
parish
three
being
moment
bring
up
whole
beautiful
than
forestry
its
tourist
among
commission
those
limestone
fossils
margaret
girvan
ayrshire
uncle
1919
1936
split
leaving
father
kate
lower
1910
bailer
harvester
m.p
fireplace
oven
lasted
111
suckling
limousin
showing
1800
72
78
cutter
42
ploughs
manor
stages
altogether
controls
tank
rapid
whenever
protective
clothing
container
seeing
well
gallons
lime
arches
points
broken
10th
falling
cure
blind
throw
luck
free
over
flat
near
worked
provided
sand
soil
become
famous
early
british
could
took
men
known
allowed
produce
small
farmers
modern
so
new
again
they
still
available
often
except
hobby
church
products
festival
flower
held
84
became
four
service
week
follows
order
rural
lady
elderly
mostly
attend
sunday
weekly
good
remains
times
connected
necessary
1850
advent
development
accessible
introduction
retirement
venue
dormitory
rally
refreshment
fayre
annually
festival
musical
event
sing
deer
ask
five
48
roam
fallow
red
roe
black
forest
operational
environment
free
low
pet
a.
evans
cubs
drives
whist
joan
bingo
dancing
carnival
civil
ruth
caroline
pigeon
successful
prizes
win
firth
keith
six
lambs
wool
cuts
feeding
nowadays
rectangle
settlements
age
iron
enthusiasts
hope
beside
tends
coverage
assisted
donna
sharon
amanda
ashley
suitable
learned
follows
southern
atlantic
coast
tracks
hedge
ford
exist
plans
renovation
income
rates
bottled
vehicles
instruments
fashions
fashion
blow
ears
out
private
supporters
tickets
necessity
recreation
shooting
skittles
female
male
stuart
friendly
league
despite
influence
rector
1841
choosing
queen
somewhat
noon
woman
noted
church.the
memorial
continued
whistle
topic
3.30pm
arrive
rats
pile
tired
farm.the
demolished
hedgerow
apparent
demolition
root
breeds
champion
dorset
hampshire
few
earl
pole
cottages
boast
ne
se
area.a
trunk
approx
victorian
newbridge
hidden
ornamental
34
forming
foot
occupants
liberal
1927
gatherings
university
sir
leader
affected
mineral
bridges
overgrown
38
mined
unit
modernisation
lambing
parlours
sheds
reflected
acreage
risen
agricultural
home
extending
capital
gateway
newport
borough
memorial
offices
around
dartmoor
easily
woodlands
parkland
1886
semi-detached
'the
hunt
kennels
skin
hounds
drawn
floor
writing
buried
so
funeral
weddings
1979
1967
170
life
unless
obtain
connection
considered
pride
westminster
abbey
monuments
polluted
apart
hobby
dye
barges
ports
existing
peregrine
eldest
replied
recorded
local
seventeenth
continue
twentieth
reclaimed
bush
p.
enterprises
fresians
herefords
slaughtered
fleeces
oats
maize
mechanised
employee
reception
division
sub
authority
10am
11am
7pm
8pm
enquiries
reports
complaints
licences
presentation
vehicle
sergeant
under
co-operation
trust
officers
officer
dominates
quarrying
summit
archaeological
toll
maintaining
activities
bad
condition
medium
silage
farms
sun
1948
glebe
kelly
extension
1972
scottish
slight
approach
hens
ill
returned
doctor
breakdown
law
punishment
release
sample
210
beef
u
grassland
agriculture
centred
cereals
strong
freisian
represent
flocks
breed
fleece
purposes
useful
reflecting
developments
trends
traditional
many
did
that
range
survey
such
made
milk
bread
roll
about
forty
list
during
families
meat
surveyed
bought
cream
per
including
agriculture
results
occupations
residents
employed
rely
construction
interviewed
be
found
same
selling
eleven
engineering
factory
ten
teachers
training
catering
nine
workers
eight
apart
corn
little
work
either
miles
within
between
travel
each
while
place
person
journey
twenty
nature
travelling
who
variety
dialect
nevertheless
accent
settled
agriculture
occupation
usage
finds
crops
barley
neighbouring
crafts
categories
traditional
occupied
nearer
services
estates
londonderry
equally
districts
rely
garages
therefore
probably
bridge
1987
massive
9th
independent
relay
lying
folded
filling
eaten
sweet
apple
baked
heads
tea
scones
boiled
dallas
sad
team
escaped
army
prison
fighting
among
76
lancashire
man
december
1891
transport
1914
trap
ran
fare
crossing
lake
border
counties
encourage
wheels
upper
secondary
transported
provision
shared
deciduous
fenced
yoghurt
employees
thirds
bristol
london
108
ploughed
drained
installed
effluent
grass
supporting
totally
wells
chapels
minister
mothers
union
attached
heath
dishes
beds
kitchens
sitting
bacon
sausages
strawberries
calls
do
how
you
every
out
six
distance
square
when
ambulance
go
does
it
take
get
your
mile
takes
we
always
help
time
need
what
man
years
clean
common
average
here
3.00
july
pm
taken
bridge
west
cars
270
vehicles
vans
buses
lorries
june
mrs.
lived
1939
stand
councillor
town
1978
district
year
open
community
fun
run
started
enjoy
interested
much
goes
doing
like
just
television
watching
shell
exercises
relating
often
bomb
safely
american
troops
sink
routes
remove
advantages
marsh
splendid
cycling
jogging
dramatic
workshops
jelly
seconds
artificial
text
pages
lakes
policeman
swim
rivers
licensed
rowing
approved
poachers
remote
valuable
mix
dung
tar
olden
brick
material
living
supermarket
prefer
area.we
relatives
bull
lighthouse
1879
frequent
appeared
portable
sons
25th
captain
husband
horn
namely
dispersed
combine
forage
planting
125
passenger
trains
freight
rush
england
travels
talking
trains
allow
loose
blocked
carriageway
dual
links
jams
tourism
freely
moves
bottle
neck
increased
population
caring
restricted
request
exeter
protestants
r.c
1933
horse
catholic
foundation
newspapers
1981
noticed
firemen
why
damage
those
aisle
nave
origin
seriously
vicar
gravestone
dated
sound
stocks
locked
almost
woodlands
managed
7th
bradford
43
roy
beech
fir
larch
pine
scots
30,000
sawmill
fence
panel
garden
gates
lots
saws
panels
cattle.the
tourism
conifers
sausage
skins
lane
drives
walkers
indicates
quantities
stony
relatively
undulating
enclosed
cultivation
picturesque
bends
prevailing
dutch
elm
bike
chain
basket
bmx
tricks
teaching
caretaker
assistants
accidents
safer
nearly
blood
last
seabirds
muck
'the
cups
needing
sport
swimming
cinema
indoor
entertainments
rd.
information
theatre
frank
entertain
crime
rate
increases
theft
avenue
princess
turned
64
continued
p.7
36
motorbike
patrols
try
mind
safety
dennis
wigtownshire
bushes
protect
fumes
noise
lemonade
crossed
hut
moors
newsagent
developers
parks
milton
thus
celebrations
race
metre
traditionally
'd
have
indigenous
and/or
hear
peaceful
residential
people.there
cosy
warm
whitchurch
functions
*
eleven
fraser
clan
closely
linked
traced
14th
chief
lovat
title
12th
burned
duke
beaufort
16th
founder
remembered
free
scotland
operates
administrative
addition
prayer
practical
third
report
minister
manse
muir
presently
cameron
don
remedial
glen
medicines
sorting
delivering
mail
keen
gaelic
tree
cell
graveyard
survives
cairn
linking
derives
south-west
--
writes
old.it
steven
jamie
knee
volunteers
discuss
happening
blacksmiths
modernised
agricultural
sort
basically
grand
mother
bulldog
play
alike
players
chases
player
chase
somebody
gayton
shouts
bigger
speak
quieter
by_pass
woke
sister
gran
daughter
washed
.we
lie
cycle
dressed
coat
school.i
music
chairs
men
working
alterations
brethren
middle
hunting
attitude
fences
removing
relies
extensions
machine
silver
silver
individual
rolls
newspaper
libraries
users
facility
opportunities
toddler
wed
fri
thursdays
national
womens
fit
keep
is
middle
windy
cared
baskets
pub
unemployed
building
trade
nursing
factory
workers
housewives
dinner
dog
voluntary
walker
engineer
conversation
marina
yachts
chair
thinking
cable
hillsborough
linear
subsequent
semi-detatched
district
lodge
1500
butcher
peoples
1843
1977
resource
/
cookery
p.e
village.the
network
distances
smaller
lead
cycles
goods
heavy
tonnes
causes
mobile
sixteen
english
shift
wakes
nan
dont
finish
1965
renovated
minibus
pony
connects
heavily
easterly
westerly
balquhidder
township
craig
colourful
slope
up
generation
supported
shepherds
firstly
fallen
glen
incomers
abroad
germany
crowned
imposing
looking
struck
across
peat
seperate
small
poultry
midlands
courses
learning
stretched
scene
thirteen
sailed
see
bishops
residence
trailers
pen
mains
fires
freezers
televisions
washing
afford
enjoyment
beauty
scenic
allotments
remaining
prawns
piped
prior
incoming
coal
swansea
carts
m
published
printing
typing
donations
grant
anyone
regular
associations
articles
quiz
paint
holiday
exhibition
sale
proceeds
research
exhibition
patchwork
tapestry
cooking
golden
slice
chaffinches
blackbirds
thrushes
ploughing
bird
poles
prey
foxes
rarer
badgers
unfortunately
surprising
weasels
pests
sporting
youngsters
bowling
matches
senior
rifle
bore
range
1958
nd
g
president
2pm
30p
wives
toddler
15p
20p
mums
toddlers
evenly
considering
task
poorly
ice-cream
tumble
enters
extracted
manufacture
likely
beacon
sound
twenty
dropped
percentage
attracted
6.30
8.45
wages
interests
councillor
studying
connections
prisoners
wars
memory
presented
flags
flag
overall
overnight
attending
increasing
anniversary
loads
annual
opening
lion
majorettes
country
cheese
wine
fair
songs
valley
spirit
floral
night
price
entered
erected
captain
centenary
e.
judo
heated
our
wildlife
grassland
woods
ash
include
oak
large
plants
wild
animals
foxes
rabbits
deer
red
institute
women
hall
aims
demonstrations
birthday
entitled
badminton
upwards
afield
competitive
leagues
autumn
singing
1885
shop
coaching
inn
miller
pension
trinity
military
roundabouts
1,000
dogs
drive
cash
competitors
winners
1856
portsmouth
met
subscription
130
screen
33
7.30pm
9.30pm
flowering
johns
bluebell
cats
wild
speedwell
herb
holly
campion
harvesting
ed
bears
latin
sign
5th
mid
flowing
devil
released
sauna
artist
dirt
concentrate
paints
interested
memories
oils
freeze
centrally
located
demand
extent
books
guide
1912
gill
study
area
scout
brook
cherry
circles
northwards
x
entire
550
map
ruins
develop
portion
notice
hugh
succeeded
dwelling
ancestors
kent
mansion
cigarettes
tag
canteen
duchess
remember
gloucester
remembers
eighteen
habitat
revealed
due
predominant
encourages
hawks
finches
tits
squirrels
moles
shrews
voles
arranged
periods
entertained
soup
flower
electricity
generator
gas
emergencies
housewife
calor
open
merchant
oil
depend
recorders
saving
cleaners
deer
marie
robins
designs
close
jubilee
r.a.f
d-block
ridge
ridge
stays
hides
jumps
hope
pretend
inner
fifth
1865
450
calf
pens
65
bonfire
lit
warn
spanish
renewed
vestry
monument
fell
gales
sponsored
bellshill
glasgow
smell
even
fruits
tropical
shoppers
9am
10.30am
break
jumping
chips
back
go
ben
do
watch
play
bakery
pies
depots
afterwards
ers
vandalism
baths
hanging
nothing
extremely
headmaster
speaks
crown
guild
judge
horticultural
member
newton
chiefly
shoot
scrambling
aeroplane
model
attitudes
car
ensure
impression
relaxed
pursuits
staying
charter
conveniently
throughout
hills
runners
lions
walk
roast
parade
night
mid
celebration
boxing
square
theatres
halls
folk
dances
displays
j.
sessions
occasions
enlarged
doorway
staircase
value
shillings
1600
colin
tiles
it.it
rod
rally
vauxhall
shirley
garth
5.30pm
.they
shops
butcher
baker
cole
1893
cuttings
wo
mini
bus
grades
inches
dust
digging
clock
o
drop
operator
motorway
23rd
trying
preserve
people.the
forest
properly
proper
castle
river
national
wood
smoked
ropes
rushes
harvesters
smithy
tools
graze
rights
deaths
injuries
suffer
strictly
drought
bill
foxes
ft
gamekeeper
perhaps
pheasants
rears
outcrop
climbed
nineteenth
viewed
daisy
thistle
clover
cow
vetch
early
orchid
plantain
rose
tadpoles
mammals
elder
ash
chestnut
willow
alder
rowan
hawthorn
birch
hazel
altogether
ourselves
bank
native
turner
dwellings
school.there
table-tennis
etc.the
altar
dedicated
eucharist
pulpit
baptised
pray
weekdays
organist
choir
readers
councillors
overseas
dark
damp
mild
lush
fresian
sunk
springs
commuting
increasingly
limits
knit
treasure
pantomime
enthusiastic
thriving
vicarage
churches
saints
scope
unused
reputed
rector
killing
1934
additions
inscribed
interior
celebrated
amalgamated
attendance
attended
focal
prepared
comment
cleared
hawthorn
elder
hazel
holly
campion
herb
foxglove
penny
bill
goose
purple
vetch
marsh
primrose
daisy
280
concentrated
bottling
4.00pm
peas
heavy
products
porridge
aided
studied
tracey
climbs
drops
state
consider
frequently
sparse
heavier
television
delivery
pence
continuing
european
independent
heard
terrain
channels
52
badge
liverpool
shorts
beaten
tough
adrian
spoilt
platform
platforms
transporting
guard
cleans
arm
cleaner
holy
father
son
26th
november
1971
reopened
autumn
northern
drains
protected
eastern
positioned
g.
knew
once
pulled
girl
identity
guards
soldiers
stationed
museum
tyre
welding
h
shaped
structures
likes
character
proposal
abbot
businesses
manufacturing
cider
disappeared
speech
spoken
contributed
basin
telegraph
basalt
upland
land.the
regional
blackpool
101
106
motto
fringe
geographical
birch
woodland
proximity
rainfall
eventually
ball
abundance
hence
gala
golspie
staged
emphasis
bands
highland
exhibitions
catered
fancy
dress
parades
maker
returning
loch
amateur
pitches
region
monks
revolves
parochial
billy
dr
graham
mission
christians
committed
christ
jesus
copses
dotted
where
9.00pm
lays
tents
sew
blouses
skirts
ties
express
century
part
grammar
cromwell
somerset
individually
pudding
attempt
injections
sees
ours
stoke
boring
electronics
zoo
shelves
8.30
7.00
notices
anybody
orange
entertainment
recreation
electronic
93
=
video
88
29
58
popular
darts
cycling
netball
snooker
ment
specific
employment
shopping
patches
beneath
styles
13th
1839
1898
1901
1904
1922
1938
<
>
ages
bradley
way
br
buyers
d
fairs
repairing
suffered
contribution
companies
pupil
sore
animals
knighton
application
teachers.the
bracken
cathedral
17th
view
flint
best
changes
lots
population
down
girls
gone
boys
toilets
facilities
sports
practice
things
teaching
us
mrs
past
lot
where
far
short
her
looks
quite
n't
field
horses
side
think
cows
keep
appliances
households
39
mobile
newspapers
magazines
milkman
planning
classes
arts
sought
m5
motorway
count
main
cyclists
official
careful
aware
concerts
baptisms
practise
ring
refurbished
63
related
44
farmworkers
baker
diy
hare
nuisance
mallard
heron
canada
common
geese
buzzard
hawk
sparrow
hen
owl
robin
sail
drinking
knitting
milling
town.the
promote
cat
inspector
'll
tail
corridor
disappear
duty
checking
going
1881
teach
fisherman
alison
girl
sisters
netting
pleasure
calm
31
st.margaret
warmer
sandstone
kilometers
dries
mudflats
golfing
cousin
alexander
st.mary
cooker
calder
dealer
mounted
half
\
lochs
poaching
eagles
wallace
kids
buys
harrows
baler
5.00
conference
england
bisects
underway
aviemore
foster
teacher
ross
p6
mcdonald
p7
manager
6.30am
department
issues
meeting
1pm
personnel
inverness
airport
grants
7.15
dresses
showers
advertising
st.david
5000
n
1.5
sq
urban
members
funerals
pastoral
situated
involving
creatures
badger
kill
weaving
taught
spun
jumpers
knitted
blankets
jackets
dyed
shearing
unfortunately
rabbits
colonies
plenty
despite
owls
daddy
mummy
downstairs
calling
chat
ages
mummy
baptist
brigade
cubs
skipping
circle
sally
eg
chalk
den
ofthe
draughts
snakes
retained
class
junior
continued
page
ness
nose
huts
1690
press
priest
jobs
fished
crescent
den
german
planes
type
uniform
blouse
skirt
tie
striped
typical
video
94
favourite
meal
least
rice
wildlife
alot
hedgehogs
killed
bats
enormous
lapwings
seagulls
woodpeckers
canal
mallard
man-made
herons
swans
owls
robins
sparrows
wagtails
wrong
eyes
fairy
winner
reference
childrens
courts
contrasts
citizens
weed
belonged
manages
thrive
nettles
warblers
