,
davids
many
st
come
to
tourists
and
mainly
see
the
.
also
coastal
old
people
views
air
fresh
get
here
there
are
countryside
many
places
in
is
stay
&
cross
hotel
old
the
guest
houses
there
other
accomodation
caravan
like
available
parks
cottages
by
coach
drive
or
back
?
after
it
this
year
it
because
of
be
food
might
lots
welsh
community
a
for
week
majority
who
but
day
only
some
parties
my
early
farm
father
on
works
busiest
summer
time
have
when
potato
season
starts
help
has
mum
my
nights
goes
school
i
at
home
left
sister
nine
until
weekend
go
over
picks
potatoes
bags
tractor
difficult
sell
very
low
prices
so
as
up
will
hard
tell
when
per
they
3
you
about
age
down
playgroup
start
paint
play
with
years
you
dress
sand
run
things
been
them
4
leave
can
then
nursery
(
county
primary
school
know
other
children
learn
read
own
toys
write
your
person
called
runs
5
going
c.p
choice
either
church
wales
)
both
schools
infant
junior
parts
in
names
reception
takes
class
infants
lower
juniors
primary
upper
canteen
road
lunch
packed
too
where
seven
:
art
english
maths
science
11
ysgol
any
choose
lots
subjects
headmaster
30
staff
court
tennis
working
pool
swimming
fields
football
lifeboat
sports
station
'
may
better
getting
new
john
round
trips
dangerous
most
one
coast
accidents
area
covers
from
fishguard
ago
few
weeks
oil
ran
tanker
which
killed
out
went
covered
was
washed
came
special
fire
call
every
must
next
ready
crew
jones
lewis
norman
dad
workers
2
full
barry
owen
they
kinds
two
_
good
last
ten
23
engine
speed
busy
how
what
never
traffic
broken
once
used
november
1984
calls
had
38
far
cost
another
15
force
two
men
off
plans
put
sold
life
purpose
sea
natural
fish
keep
big
glass
tanks
students
that
study
their
visitors
show
national
park
planning
now
raise
coast
an
beauty
tourism
being
path
around
miles
dyfed
square
park
population
high
's
designated
finally
such
large
numbers
supports
hope
carries
work
future
employers
labour
major
area.the
employs
factory
ladies
make
produces
products
sells
finished
sent
britain
great
some
owned
bank
branch
five
winter
customers
fifty
daily
during
rate
hundred
rises
great
success
caused
more
open
bank
obtained
recently
computer
helps
important
piece
equipment
stores
rates
asked
manager
david
mr.
ever
if
''
said
his
patients
books
he
60
doctor
car
radio
ambulance
speak
he
needs
reaches
usually
ground
needed
snow
would
1982
could
reach
four
were
ireland
man
ship
surgery
till
again
opens
city
library
tuesdays
twelve
six
thirty
three
also
fridays
times
written
famous
pupils
take
hughes
especially
use
stands
valley
built
building
present
peter
de
church
parish
active
bishop
carmarthen
control
lives
dean
under
mr
morris
assistant
choir
part
am
member
choir
consists
eleven
girl
female
male
sing
wednesday
thursday
practice
service
do
n't
concert
festival
may
we
did
lot
fun
sunday
sarah
today
name
7
got
o'clock
normal
wore
dressed
bed
took
bag
made
for
breakfast
downstairs
cheese
orange
toast
then
drink
started
walk
evans
best
friend
she
bell
lined
assembly
our
reading
sir
while
first
lesson
quarter
hour
into
maths
half
walking
short
different
gives
us
friday
say
prayers
t.v
bit
watch
clothes
riding
supper
eight
past
bird
towards
known
rocks
west
heavy
night
tonnes
fuel
this
report
18th
1985
june
save
died
affected
birds
these
training
badminton
lessons
piano
join
older
air
training
its
camp
enjoy
just
badminton
matches
each
playing
all
city
hall
divided
library
centre
main
memorial
council
centre
information
find
sites
enjoyable
hall
main
along
held
plays
sales
coffee
mornings
extension
moment
bigger
stage
w.i
mini
markets
meetings
services
kitchen
squash
council
mrs
hold
phillips
mae
sydd
tua
y
yng
cymraeg
yn
cael
ei
r
does
llawer
bobl
byw
n
sy
mae
o
saesneg
ty
i
un
wedi
yr
eglwys
bob
rhan
plant
yw
eu
fel
hyn
town
rock
top
from
nearby
via
now
except
quiet
local
beach
attractions
slate
boats
land
farmed
grass
grazing
fodder
a
pembrokeshire
north
spot
right
through
block
robert
west
corner
county
former
little
``
often
england
milford
adjacent
region
agriculture
mixed
dale
village
{
}
port
haven
pass
recreational
red
6
above
drained
streams
e
s
flowing
climate
mild
not
32
average
whole
year.the
feature
beautiful
flora
rich
coastline
rocky
steep
small
larger
sandy
aim
tourist
facilities
residents
appearance
buildings
allowed
limited
throughout
maintain
footpath
passes
wildlife
give
historical
lead
walks
at
end
northern
similar
river
estuary
flows
these
;
flats
form
marsh
mud
attract
water
variety
feeding
nesting
red
etc
common
species
british
seen
particularly
beds
nest
sometimes
attracts
number
most
months
excellent
easy
club
storage
repair
shop
races
sheltered
visit
others
landscape
flowers
fact
safe
plenty
pools
space
45
total
holiday
among
sited
housing
no
residential
10
subject
soon
drives
looks
brother
cattle
mother
little
house
makes
tea
homework
comes
sleep
after
bath
watches
children
beaches
build
catch
games
playground
skipping
fathers
hide
mothers
seek
bikes
swings
climb
trees
woods
field
fly
cricket
keen
grow
vegetables
well
popular
shows
taking
dogs
looking
pub
meet
talk
friends
homes
done
using
whom
several
bay
castle
six
commercial
fishing
smaller
ones
others
putting
line
boat
caught
afield
further
way
local
suitable
rescue
cars
edge
usual
though
longer
courses
given
basic
april
hardly
sailing
height
leisure
90
occupied
1
harbour
150
kept
point
50
about
brought
40
long
racing
organised
general
mostly
interesting
boy
nature
germany
continued
became
war
field
as
members
public
him
series
history
provided
pollution
we
survey
worked
18
ages
between
employed
follows
--
agriculture
college
85
=
rest
retired
47
-
48
below
making
henry
tudor
500
near
richard
mill
away
followed
august
showing
stall
yard
girls
pig
women
boys
unusual
+
200
acres
farms
crops
planted
machine
necessary
hand
spring
combine
beef
hay
silage
cut
120
one
cows
dairy
streets
north
south
sides
situated
close
side
100
least
stone
thick
walls
cement
colour
originally
estate
roads
bungalows
semi-detached
terraced
married
station
traditional
largest
privately
company
offering
their
selling
clothing
business
office
post
offers
craft
house
restaurants
hotels
inn
reading
our
entrance
includes
paintings
sale
last
ships
channel
route
light
mark
tower
sorts
including
carrying
east
iron
timber
roads
churches
tide
waiting
anglican
belonging
800
renovated
seat
wooden
charge
vicar
neighbouring
founded
possibly
ancient
16
p.e
teacher
bottom
classrooms
dinner
sandstone
31
bus
14
animals
12
carew
blocks
limestone
partly
studies
8
teaching
doing
lord
weather
rainfall
agricultural
milk
production
central
flourishing
honey
disused
walkers
mill
haverfordwest
almost
comprises
wide
cliffs
metres
quite
highest
75
maximum
bracken
cultivated
rough
very
minor
well
developed
hedgerows
than
villages
farming
tourism
town
exists
industry
itself
estate
owner
hill
within
mrs.
southern
catchment
forms
river
slopes
western
cleddau
400
due
feet
south
winds
largely
although
arable
poor
certain
drainage
amount
bog
much
reclaimed
family
language
predominantly
attractive
although
site
income
morfa
mynydd
grassland
moorland
fort
visitor
foot
locals
lanes
meeting
point
ridge
before
rising
stream
across
pembroke
east
junction
'the
whilst
continues
hamlet
century
manor
36
on
caters
bar
evenings
nearly
extra
part-time
july
september
february
fairly
support
drinks
meals
occasions
farm
barley
grows
sheep
breeds
hereford
farmer
tractors
machinery
modern
sheds
70
its
corn
friesian
everything
hay
ian
ford
international
taken
various
shed
milking
parlour
store
25
9
calves
35
fat
ewes
lambs
ducks
hens
20
dog
geese
pet
four
parish
rev
roger
vicar
williams
holy
pm
sundays
month
third
teachers
miss
people
youth
meets
mothers
union
monthly
lloyd
opened
december
monday
owners
whose
following
davies
post
1972
since
37
taught
attending
before
authority
together
board
government
councils
changed
situation
1974
community
rights
greatly
influence
environment
inn
michael
cater
january
march
live
disco
music
occasional
dancing
records
darts
social
range
becoming
exciting
stones
found
removed
grave
only
buried
all
chief
flat
holes
wood
earliest
metal
cardiff
museum
premises
foods
snack
wine
80
cleaner
addition
occasionally
entertainment
provides
home
extends
market
controlled
running
association
sports
committee
organisation
funds
consist
horse
slide
pitch
changing
facility
electricity
supplies
provision
areas
woodland
reared
thomas
rearing
james
chain
stables
yards
58
horses
head
350
beulah
regular
crop
stock
pick
neath
hedge
cutting
calf
jack
water
lake
300
cattle
of
race
october
lived
enjoys
geography
university
adult
teaches
domestic
2000
secretary
every
provide
evening
meal
plus
woodlands
dad
grounds
uses
paths
farmhouse
let
owns
garden
chickens
goats
pets
eggs
lower
george
tuesday
250
young
bull
three
jenkins
driver
wednesdays
bulk
24
holds
milked
golf
course
played
fee
pleasant
membership
free
carry
golf
game
players
system
totally
surrounding
sport
proved
receive
thousand
drawn
midlands
valleys
effect
include
resident
train
clubs
told
fancy
sponsored
charity
need
club
video
room
snooker
cafe
restaurant
employ
permanent
caravans
replaced
families
catered
interviewed
cottage
living
moved
move
1975
painting
country
think
art
gallery
frames
essential
transport
shopping
problems
serious
trade
items
trip
produce
acre
brings
gets
motor
feed
carried
fences
maintenance
winter
summer
electric
television
wash
!
1971
power
stations
fed
national
always
expensive
reasons
popularity
programmes
street
created
supplied
latter
double
pipeline
section
pump
steam
degrees
enough
stored
holding
current
days
supply
produced
turn
huge
waste
21
base
actually
means
dust
leaves
secondary
self
contained
gas
producing
costs
however
recent
coal
annual
having
locality
me
wait
enter
rings
finish
nature
cup
lady
19
western
biggest
change
today
news
phone
whereas
inside
dock
story
thing
still
hours
hospital
paper
strong
presence
hospital
17
ward
care
unit
money
handicapped
filled
morning
office
relatives
those
regularly
travels
weekly
abroad
linking
stories
firms
travel
holidays
improved
completely
photographs
to
gave
job
her
without
nurses
professional
perform
farmers
wife
same
cow
tank
marketing
milk
depot
machines
instead
cheaper
soft
perhaps
causing
deal
damage
during
royal
chosen
grew
size
employing
world
steel
demand
fall
began
position
really
closed
mile
1960
officer
page
based
cardigan
pond
second
discovered
cause
involved
fully
types
cold
extremely
conditions
wear
tables
clear
rural
industrial
1981
amenities
isolated
hamlets
outskirts
neyland
farmland
estates
associated
narrow
13
estates
industrial
development
reduced
opposite
hire
5th
construction
engineering
ranging
group
late
type
introduced
competition
dairy
dedicated
animal
list
herd
birth
date
graze
elizabeth
remaining
erected
gate
another
lost
occur
formed
lane
increase
several
later
horse
society
closure
plants
long
access
crosses
pasture
joins
outside
track
bridge
level
lady
mark
white
picnic
table
gates
style
belongs
walked
wild
fair
saw
rare
spotted
returned
earlier
visits
mean
c
autumn
wet
coming
tradition
queen
events
villagers
compete
organise
set
serve
stalls
place
competitions
day
hunt
j.
saturday
event
competitors
even
existing
complete
length
farms
typical
door
front
stairs
painted
white
grey
roof
quarry
farmhouses
properties
dwellings
look
road
setting
bridge
dropped
walk
behind
roberts
jobs
bike
paul
collection
stop
telephone
box
green
flower
younger
boys
everyone
trousers
pop
groups
tv
nicola
*
domesday
dominated
derelict
alongside
district
commission
1860
named
war
world
1950
since
firm
structure
original
remain
thought
view
shape
chapel
rebuilt
st.
belonged
worship
andrew
concerned
employment
industries
opening
against
noise
installed
arrived
companies
advantage
deep
1968
rail
petrol
heating
contains
separate
contain
final
links
populated
manchester
constructed
million
distributed
covering
undulating
managed
separated
wooded
scattered
rosemarket
established
12th
century
rhos
importance
centuries
each
hill
leading
team
looked
league
saturdays
prepared
wives
oldest
player
34
cricket
lasts
warm
teams
elected
clerk
anything
clean
pay
councillors
paid
eat
cereal
teeth
fifteen
pool
swimming
village
watching
trying
hands
sit
visited
project
should
twice
week.the
spent
starting
harvest
vans
someone
fast
says
published
trail
class
junior
printed
prize
both
's
church
the
farm
well
railway
hall
village
1978
classes
infant
aged
a.m.
begins
finishes
p.m
games
dinners
cooked
van
bring
sandwiches
words
fine
middle
bad
something
standard
throw
e.g
interest
bought
groceries
sweets
meat
newspapers
goods
bread
varies
government
increasing
stopped
new
tend
higher
closed
probably
between
twenty
attend
burton
seats
chapel
serves
united
attended
afternoon
morgan
minister
no
believe
feel
boundary
1920
basis
helping
guides
company
blue
uniform
movement
theatre
won
brownies
brown
belt
tie
yellow
pack
banks
therefore
offices
livestock
with
developments
market
rapidly
6th
officially
district
overlooking
rent
shops
voluntary
board
slow
varying
windows
doors
onto
brick
housing
laid
materials
roofs
recently
tenants
evidence
businesses
grants
converted
family
mary
william
granted
become
1st
fair
price
sections
mid
first
ladies
farming
thriving
1976
lane
furniture
units
designed
aid
learning
services
social
disabled
until
loss
met
area
education
authority
meant
connected
link
street
origin
connection
linked
close
way
here
examples
she
ideal
touring
note
28
recorded
1983
show
ends
helped
record
rees
conducted
approximately
mart
comprehensive
schools
split
pupils
college
further
st.mary
crafts
period
martin
castle
summit
churchyard
chapels
presbyterian
catholic
roman
male
locally
1000
chapels
1986
parry
band
travelled
1980
music
concerts
individual
private
.the
special
adults
transport
dates
13th
falls
steeply
museum
19th
fell
destroyed
count
later
mum
bacon
chips
cake
film
placed
**
own
questions
idea
%
65
scheme
porch
demolished
apart
good
on
window
face
...
housed
ways
according
direction
<
>
none
sixty
gallons
source
to
water
for
us
through
with
added
of
be
in
improve
responsible
rivers
open
display
police
army
ponies
..
arrive
parking
entered
most
day
700
council
do
hedges
1979
doctors
general
wards
baby
league
pastures
flow
spring
useful
else
stone
next
green
fires
after
win
houses
eventually
leads
reserve
an
clare
charles
police
themselves
mayor
1840
borough
formerly
led
local
husband
child
rugby
public
by
turned
travelling
tip
b
clearly
rd
signs
posts
operated
mains
workshop
hot
as
new
mixture
ask
able
by-pass
because
elsewhere
distance
moving
towns
footpaths
hills
numerous
shelter
foxes
rabbits
age
attraction
christian
denominations
represented
baptist
methodist
attached
elderly
possible
pottery
dance
dry
floor
clay
cook
eisteddfod
custom
ceremony
presented
performed
musical
language
shopkeepers
french
bristol
american
decided
oak
peace
plan
black
newspaper
outlying
included
stackpole
lies
nearest
hilly
agricultural
trust
builder
worker
mentioned
pensioners
served
buses
passengers
empty
rely
upon
if
cats
rabbit
favourite
hobby
nursery
department
begin
term
headmaster
native
speaking
dining
assistants
party
urdd
singing
considerably
settlement
thus
greater
forty
questioned
couple
london
pastimes
gardening
do
sewing
young
collecting
scenic
private
accommodation
grain
state
extended
sheep
grown
quality
bedrooms
remainder
dating
nineteenth
property
previously
material
1970
activities
currently
organisations
exist
committee
whist
choirs
visiting
fete
raised
parishes
religious
girl
camping
outdoor
senior
christmas
delivered
senior
youth
enjoyed
successful
winning
fourth
example
wells
entirely
influx
surveyed
reached
restored
appointed
himself
letters
received
asking
surface
stretch
letter
passing
cleared
fewer
prepare
planting
keeps
butter
cream
vary
island
farmers
try
born
memorial
memory
and
studied
helen
edwards
karen
powell
griffiths
suffered
4th
grid
sign
minutes
gone
crossed
square
over
ride
sometimes
buy
tree
gold
cross
garage
enclosed
powys
problem
club
check
prominent
features
answer
lines
cosheston
eastern
apart
part
growth
reason
unemployment
factories
enterprise
lime
quarries
rubbish
soil
hoped
already
frequent
nearly
parents
routes
pleasure
railway
institute
women
pubs
cinema
tenby
discos
theatre
lovely
cat
mondays
thursdays
7.30
comprehensive
cleaning
washing
break
lie
swim
spend
unemployed
bicycles
telephones
videos
computers
childrens
hobbies
watched
remains
not
gareth
j
59
pretty
rolling
border
barn
badgers
squirrels
seem
herds
pigs
poultry
oats
wheat
detached
cottage
combined
officers
garages
swansea
want
journey
permission
invited
increased
rise
p.m.
match
son
11.00
showed
county
safety
school
leisure
attracted
attempt
rain
week
carnival
star
20th
run
liverpool
breeding
suffolk
changes
2nd
3rd
rooms
hotel
declined
14th
disappeared
head
mobile
secondary
smith
extensive
9.00
a.m
noon
bringing
collected
once
return
pounds
bred
surrounded
adjoining
beginning
less
fish
breed
shore
sporting
order
blue
small
habitat
nothing
yet
near
standing
varied
lucky
communities
coal
measures
glacial
delivery
boxes
collections
pence
passenger
trains
high
mail
employees
m4
lorries
deliver
trout
port
rock
celebrated
easter
households
rented
1945
generally
1900
design
fields
decade
modernised
coloured
health
health
gardening
encouraged
scouts
interests
raising
spoken
down
is
magazines
collect
papers
develop
efforts
pictures
knitting
interested
undertaken
hectares
pit
carriageway
improvements
22
egg
cycle
transfer
programme
clubs
folk
dancing
drama
exchange
physical
service
mother
black
group
womens
wood
annually
concern
purposes
recreation
flood
churches
oak
however
are
there
two
chapel
one
welsh
called
this
was
now
an
but
house
building
has
it
small
at
not
present
or
wales
no
and
held
sunday
few
mainly
these
main
which
life
every
also
summer
very
other
old
young
last
by
farming
quite
that
will
past
use
land
hill
if
road
then
because
such
end
would
children
roll
juniors
woman
focal
welsh
education
but
due
family
have
time
his
name
live
they
valley
when
royal
between
their
west
members
century
its
being
houses
services
area
some
work
four
miles
up
into
much
trees
housing
place
built
all
from
stone
usually
clubs
used
can
include
facilities
year
both
field
football
play
until
been
milk
more
sheep
180
farms
acres
situated
once
population
high
came
first
people
although
each
families
many
homes
located
purchased
liked
occupation
pocket
attendance
blacksmith
inhabitants
happy
joined
case
pattern
map
altered
growing
where
lambing
deer
heath
squares
improvement
arrives
valley
serving
shown
spirit
allow
complex
shaped
plain
particular
cover
down
sun
atmosphere
dark
glyn
y
vale
what
heart
tall
wind
wall
love
adult
39
circle
tools
lamphey
area.there
seaside
rail
single
express
anyone
dentist
relatively
sparsely
soccer
hockey
courts
more
saundersfoot
brecon
treatment
arranged
passed
heated
indoor
toilets
toilet
policemen
required
1930
42
supported
congregation
offer
result
rather
seasonal
beans
wiston
approx
bathroom
breakfast
turns
spread
facing
wanted
whether
contractors
deciduous
conifers
conservation
ruins
harvest
fruit
picture
songs
netball
rounders
rugby
carnival
leaving
lorry
follow
procession
tried
closing
up
garden
everyone
simon
recorder
bible
hymns
brush
dinas
newport
friendly
kind
spoke
bedroom
repairs
test
nurse
engines
christopher
school.the
lisa
nice
merched
wawr
bala
ym
listen
speakers
medium
village.the
peaceful
lack
immediate
pages
project
studies
pupil
1850
brown
edward
model
normally
hair
football
census
returns
29
seems
figure
results
remember
wearing
shoes
pair
bmx
his
lowland
containing
stand
celtic
ing
completed
15th
thousands
teach
gardens
celebrate
transported
cuts
financial
father
common
providing
wool
consisting
dormitory
33
figures
maintained
lamb
employment
appear
appears
bingo
bowling
national
park
community
sea
mountain
points
court
labour
party
tennis
gymraeg
market
east
baker
falling
everybody
gained
worth
bowling
planned
economic
fertile
forest
fortnight
unique
virtually
row
fawr
appeared
activity
sample
mawr
salmon
bus
chance
maes
touch
jump
'm
forward
sure
why
cwm
band
templeton
1973
26
practise
cleaned
rose
cakes
catering
folk
ball
saint
ball
death
gardens
stable
king
17th
mountain
full-time
likes
central
vehicles
shearing
autumn
feeds
600
tons
price
upper
lights
weddings
people.the
book
carol
retirement
narberth
bus
three
office
post
schools
did
found
survey
we
like
living
were
here
town
lot
shops
lots
centre
home
station
popular
south
around
fields
years
you
so
industry
part
country
get
breakfast
my
go
out
sometimes
back
class
12.00
dinner
watch
bed
our
buildings
making
near
primary
just
outside
garden
where
come
castle
only
black
things
number
large
block
working
about
farmers
hay
sells
shop
who
she
her
little
public
days
tourists
owned
north
winter
youth
group
meet
scale
centres
venue
pwllheli
gwynedd
works
victorian
exception
questionnaire
yes
how
under
27
large
cases
shower
within
educational
yrs
unit
recreation
emphasis
climbing
ice
coniferous
forests
functions
hear
character
mining
girls
pits
becomes
societies
cheshire
giving
cubs
staying
mine
keeping
woke
radio
quickly
merthyr
leather
mines
pony
employer
miners
hired
policeman
cambrian
llanelli
birmingham
europe
countries
considerable
iron
scotland
claire
her
reads
instruments
violin
brothers
strike
sixteen
upstairs
listed
open
infants
daily
news
times
meadow
spare
heard
llyn
urban
life
previous
neighbours
cards
victoria
playtime
mills
1500
nant
shooting
wish
55
page
worms
9.30
returning
operating
dotted
historic
expansion
rear
olds
trend
supermarkets
butcher
process
ar
noted
continue
d
n
capel
r
daughter
marked
survey
hunt
believed
t
highly
hillside
ac
dydd
ond
gan
fod
w
bod
mewn
ardal
yn
pentref
oedd
sarn
iawn
mynd
oed
ysgol
yno
ol
gyda
blant
neu
hefyd
capel
iaith
considered
yma
sef
bangor
o
plas
anglesey
lounge
hit
easily
holyhead
gwyn
jones
concrete
supermarket
underground
ill
decline
bilingual
classroom
vandalism
law
abandoned
trunk
docks
prince
offered
fund
proposed
schemes
felt
gift
warden
laugharne
coaches
eg
land
crime
dances
corporation
flooding
generation
tries
body
ash
sycamore
beech
chip
builders
quarry
councillor
aberaeron
emma
llandysul
history
ni
matthew
lay
amongst
frequently
upland
bricks
workforce
minute
llansteffan
hospitals
arms
clinic
morriston
fire
bethel
independent
book
good
festival
holiday
exhibitions
society
holdings
baths
cooking
almost
sort
pembrey
hundreds
ponds
dual
vast
shopping
household
percentage
sons
bryn
science
word
meaning
forming
uchaf
0
grocery
counted
mail
shopping
belong
drivers
dyffryn
industry
cymru
weekends
second
crossing
sausage
birds
wild
cycling
gymnastics
fach
afon
nifer
out
pine
cookery
salem
sul
tracks
barns
development
likely
slope
cont
great
glan
conifer
forestry
plantations
that
1969
ring
straight
isaf
country
mumbles
forestry
welfare
improving
thinks
eating
food
transport
river
radius
much
crown
bowls
pitches
convenient
aberystwyth
teenagers
driving
penarth
footpath
fan
evening
commute
expected
cynheidre
colliery
proportion
1880
evans
german
computer
gower
cereals
bishopston
lying
half
over
cattle
going
bryn
age
made
them
different
five
help
goes
times
service
history
than
kept
1962
he
visit
coal
may
saints
arts
television
bbc
writing
steel
establishment
tin
opportunity
religious
reservoir
work
/
br
1977
collieries
ore
five
faces
value
puts
drama
graig
drop
colliery
tips
prevent
shift
threat
valleys
described
|
caernarfon
litter
mr
williams
wake
snowdonia
denbigh
fit
i.e
wrexham
pennard
during
rural
went
way
see
while
employed
junior
mum
car
enjoy
opened
am
music
away
travel
8.30
manufacturing
buckley
prefer
b
tumble
6.30
ammanford
clock
taxi
films
porthmadog
mountains
moel
borth
cefn
levels
gravel
porthcawl
compared
generations
talbot
glamorgan
citizens
monks
loughor
steelworks
pant
rachel
aled
talybont
written
motorway
shrewsbury
arts
c
garth
rows
penrhyn
conwy
chester
causes
llandudno
network
exhibition
resort
margam
duke
firemen
coed
bingo
forest
glanaman
newsagents
shoppers
abbey
1870
bees
outstanding
llangeitho
pheasants
aberdyfi
plastic
machynlleth
shropshire
hills
dead
pentre
employment
education
pupils
colwyn
welshpool
mold
orme
a55
copper
llangollen
afan
beacons
cars
ruthin
tennant
canal
canal
builth
remembers
side
llangadog
aged
llandovery
weight
ystrad
crisps
64
cwmbran
neath
next
runs
still
daily
had
ash
asda
sennybridge
llanrwst
bridgend
cowbridge
street
henllan
radnor
pontypridd
llandrindod
trefriw
llanddulas
ogmore
boys
01
rhondda
*******
****
caerau
llanhari
pencoed
works
abergele
prestatyn
pontycymer
usk
usk
defynnog
wye
llanidloes
newtown
rhayader
hope
rhyl
clwyd
gwent
june
abergavenny
tredegar
severn
asaph
deeside
pensarn
rhuddlan
holywell
raglan
llanharan
ely
dee
pontyclun
cynon
dad
flint
monmouth
rhymney
pontsticill
bodfari
dyserth
bargoed
holt
dyke
offa
chepstow
northop
caerphilly
ebbw
hawarden
risca
pontypool
radnor
knighton
beguildy
presteigne
alyn
crosskeys
abertillery
clyro
kinnerton
forden
ruabon
leeswood
malpas
magor
monnow
wrexham
caergwrle
llangybi
rossett
marford
blacon
saughall
garway
trellech
