about
belleek
was
the
when
year
in
this
built
of
on
river
because
to
up
,
were
and
where
from
over
local
a
first
made
only
for
is
it
which
now
most
at
's
.
go
house
there
but
by
last
one
family
have
people
their
used
market
come
down
day
every
men
these
with
called
old
that
big
get
years
been
out
land
an
has
until
around
hill
village
into
lough
4
ireland
special
3
are
take
you
then
be
can
they
or
few
home
35
our
use
many
so
different
had
2
cars
town
council
own
way
like
cattle
sometimes
street
14
shops
here
opened
housing
three
16
as
also
new
centre
my
station
early
he
milk
houses
not
10
11
his
cows
long
times
week
we
some
very
may
school
children
being
all
primary
who
church
june
100
30
5
miles
sold
area
main
situated
two
castle
hall
water
small
park
after
irish
40
schools
time
much
do
p.s
pupils
6
open
them
other
large
library
play
football
john
1970
more
150
road
1985
15
northern
through
car
night
industry
fish
its
each
would
if
no
building
good
on
days
in
market
stalls
all
have
line
places
the
except
for
kept
on
them
and
come
day
set
up
when
are
third
tuesday
each
many
month
of
people
a
always
when
is
there
street
to
police
very
another
woman
with
she
that
was
many
used
trade
the
become
markets
only
big
common
has
it
made
recently
there
change
more
white
now
1960
farmers
fishing
number
70
farm
26
farming
young
this
area
mainly
height
hills
rising
some
main
river
its
half
village
lies
this
within
's
fermanagh
also
share
well
''
``
as
known
parts
lough
included
majority
dairy
farming
from
agriculture
department
(
)
erne
employment
provide
few
offers
-
features
number
oldest
beside
graveyard
began
factory
production
which
first
workers
produced
were
furniture
local
sold
grown
mostly
ireland
later
decided
other
america
north
south
be
found
because
suitable
grain
hard
makes
like
an
covers
just
over
300
already
metres
square
machinery
required
such
machines
necessary
provided
making
materials
12
full-time
busiest
early
demand
time
crops
but
own
provides
transport
goods
united
our
cheese
ulster
about
one
west
david
saw
old
premises
building
grew
industry
1982
end
1984
april
company
got
small
west
into
farmers
then
room
running
converted
new
growth
produce
per
week
_
milk
whole
comes
cream
taken
irvinestown
you
certain
18
gives
hours
added
salt
give
quality
special
bring
level
8
northern
%
90
dublin
scotland
going
between
renovated
catholic
church
roman
st.patrick
congregation
beautiful
or
windows
cross
walls
at
much
a.m.
methodist
erected
replaced
roof
heating
installed
while
by
seats
church
service
sunday
primary
school
enniskillen
being
been
since
school
classrooms
five
mobile
classroom
dining
large
hall
office
it
mr
michael
pupils
part-time
both
front
play
back
covered
cover
grounds
approximately
i
morning
wake
eight
grey
my
put
blue
uniform
tea
sister
education
bus
catch
run
we
arrive
we
twenty
break
can
during
minute
computer
games
outdoor
!
again
until
work
our
enjoy
subjects
home
clothes
cup
completed
watch
go
television
limited
facilities
recreational
park
located
grass
surface
community
similar
amenities
includes
pitch
weather
one
entertainment
age
groups
centre
built
parish
club
youth
every
activities
badminton
indoor
concerts
playing
soccer
irish
classes
dancing
meetings
various
hall
clubs
organisations
fine
plays
so
written
scouts
meeting
place
friday
guides
evenings
7.30
pm
training
same
occupied
annual
holiday
their
generally
summer
year
cost
boy
girl
out
usually
works
fifteen
pounds
ten
'
most
brown
housing
programme
development
either
private
carried
housing
andrew
estates
twelve
houses
rest
six
executive
estate
later
years
developed
1973
22
further
1983
mill
government
grants
local
farmers
dairy
friesian
cows
farm
find
will
calves
held
thursday
in
recent
times
n.ireland
rough
grazing
land
pasture
sheep
summer
busy
season
hay
silage
numerous
drainage
miles
course
flows
source
little
through
three
where
mills
down
along
ground
till
too
sometimes
below
long
valley
board
spent
success
cleaning
not
around
bed
o'clock
drive
field
nearby
25
herd
milking
after
before
hour
lasts
process
breakfast
last
means
cutting
him
forest
hectares
planted
types
trees
introduced
good
easily
timber
worked
strong
europe
than
christmas
fishing
those
who
sporting
lakes
trout
usual
employed
fact
adjacent
young
wild
fairly
often
seen
rivers
situated
townland
interesting
could
island
name
tree
probably
dates
christian
against
animals
ruins
chapel
modern
us
two
family
may
worship
since
itself
difficult
date
standing
bought
club
football
drained
opened
21
service
would
community
serve
may
opening
having
though
final
services
project
provision
rooms
toilets
football
gaelic
soil
wet
sports
no
poor
consists
site
system
sown
sand
{
}
county
town
block
centre
house
former
house
national
owned
trust
open
public
flowers
gardens
oak
forest
here
original
discovered
farms
occupation
cattle
use
larger
:
herds
make
fire
water
lord
wood
they
ladies
lady
bedroom
destroyed
four
beauty
table
travelling
my
case
orange
daddy
won
he
killed
he
lived
turn
does
dog
me
favourite
lamb
had
went
lambs
brought
shed
if
said
took
care
called
ago
most
miss
teachers
children
started
left
get
way
to
foot
keep
warm
turf
girls
holidays
august
july
taught
english
geography
history
maths
tractors
.the
ford
horse
power
60
seven
thirty
call
dogs
names
hundred
cuts
sheds
parlour
holds
collect
mile
once
mill
never
ones
beds
living
cold
their
born
old
corn
entrance
no
lives
kitchen
biggest
yard
she
moved
side
&
thompson
mrs
his
order
closed
today
p7
takes
hobby
easy
really
different
ages
should
even
event
best
wear
lunch
packed
shoes
competition
pay
then
map
possible
quickly
eg
attached
corner
your
competitions
castle
head
district
council
his
department
plans
buildings
daddy
starts
complete
once
responsible
acres
before
father
fields
helps
months
dry
uses
ready
after
tractor
each
winter
box
lead
top
caught
ever
fish
john
river
country
south
road
near
meets
bungalows
shop
agricultural
post
meal
coal
at
farmhouses
instead
past
dressed
bottom
lane
help
clock
cow
o
let
feed
nights
eleven
monday
swimming
feet
pool
am
deep
think
hope
leave
jump
live
mother
hens
able
became
part
horses
helped
giving
working
far
says
named
sir
married
1000
mountain
green
red
off
follows
if
walks
goes
lot
western
present
all
largest
heard
do
n't
hand
door
next
you
allowed
william
central
first
gave
son
donegal
came
above
library
library
narrow
1
hold
thousand
clean
weeks
section
thought
might
floor
behind
brother
show
younger
county
castle
particularly
problems
landscape
rural
beef
becoming
important
major
tourist
attract
fishermen
world
shops
forms
size
wide
variety
close
prices
apart
normal
try
locally
tourists
popular
stores
east
extended
population
residential
shopping
changes
great
almost
commercial
1950
government
these
buy
rented
doing
led
price
ranging
business
offices
car
parks
particular
flats
market
street
build
owns
area.the
farmer
typical
keeps
average
gallons
twice
done
grassland
improved
regularly
store
potatoes
access
east
bridge
late
growing
north
constructed
queen
established
money
17th
century
still
although
outside
away
numbers
sell
traffic
increase
remains
saturday
apart
as
including
health
public
office
bridge
services
social
point
primary
calls
toast
leaves
9
p.m
include
lessons
reading
class
take
apple
bar
dinner
friends
t.v
homework
council
whose
next
any
given
based
religion
king
orange
james
12th
catholics
n.i
throughout
for
bands
eastern
followed
religious
protestants
british
stay
today
hospital
taking
1978
formerly
sites
urban
fair
night
vehicles
pass
life
pubs
famous
founded
80
period
railway
surrounding
hilly
fort
garden
stands
view
feature
history
education
recreation
squash
tennis
world
played
available
arrived
video
snooker
youth
discos
regular
festival
excellent
quiet
roads
white
cater
visitors
music
farming
high
they
ice
form
drumlins
areas
cut
nearly
scattered
50
yards
presbyterian
result
protestant
largely
light
engineering
following
what
stones
cross
opposite
boat
travel
lower
works
bank
stage
costing
total
agriculture
industries
;
creamery
heavy
industrial
formed
group
colin
glen
cookstown
lisburn
range
under
supplies
britain
employs
pig
putting
sides
of
increased
greatly
carrying
o
daily
lough
remainder
wanted
electricity
supply
station
24
attended
lodge
hill
war
see
cinema
concrete
mr.
died
property
wife
yet
outskirts
forty
changed
join
home
whom
free
families
receive
visits
man
friendly
rebuilt
soon
space
filled
new
changing
raising
chapel
rugby
member
increasing
beginning
facilities
some
...
stone
13
although
wall
fell
island
shore
interest
several
originally
person
serves
begins
rise
prayers
doors
study
from
did
know
minister
right
earlier
port
st
involved
churches
tower
continued
parish
story
priest
managed
body
buried
buildings
memory
wooden
19th
food
floors
sea
highest
short
catered
countryside
farmland
rearing
caravan
park
records
want
st.
doctor
practice
second
need
telephone
baby
weight
elderly
wednesday
clinic
attend
patients
playground
rope
stand
e.g
england
inside
game
others
god
collection
bread
remember
boys
schools
learn
read
7
countries
18th
netball
schools
secondary
her
evening
boys
brigade
events
meet
teams
sections
company
parents
parade
start
october
men
sent
peat
fuel
three
needed
spread
placed
using
electric
hands
amount
employees
factories
main
sells
staff
newspapers
stock
customers
women
keeping
state
roe
say
evidence
visit
walked
among
fruit
vegetables
round
survey
town
class
over
less
employ
steel
bike
motor
milked
washed
air
move
september
collects
tanker
drawn
other
double
seed
condition
brown
fed
nuts
drink
enough
animal
reared
1st
court
equipment
hair
coffee
social
sometimes
banks
abbey
type
towns
families
part
will
she
life
sports
tv
girls
well
sunday
army
serving
weekly
an
belfast
unit
blocks
terraced
storey
homes
detached
hill
railway
/
omagh
ran
londonderry
coming
gas
mc
road
rd
etc
lorries
must
across
also
hospital
paid
extension
machine
however
due
during
visited
together
prevent
broken
quarry
1980
water
storage
tank
stored
litres
million
collected
17
lorry
control
birds
cars
smaller
swim
down
mixed
meaning
>
labour
lower
every
45
fresh
plants
linen
sale
therefore
plenty
especially
<
br
walk
sales
co.
longer
200
livestock
these
streets
weekends
its
garage
costs
lack
distance
co
mountains
natural
sailing
bedrooms
fort
courses
organised
leisure
acre
bowling
golf
hole
membership
courts
matches
aged
grammar
high
secondary
grammar
college
students
another
stop
science
bell
crisps
enjoyed
books
assembly
afternoon
hockey
watched
contains
quite
populated
how
paper
without
low
better
trousers
buses
nine
sit
now
people
neighbouring
piece
spring
20
page
mixture
lots
look
grow
hedges
runs
slopes
reach
shown
job
interviewed
walking
bad
feeding
nearest
sundays
eat
ball
else
sport
themselves
asked
how
centres
moment
pleasant
mass
dance
band
single
met
full
here
tankers
500
butter
about
farm
1981
firm
boats
jobs
products
send
london
none
needs
june
grandfather
told
train
trains
lines
gone
spend
winter
getting
senior
points
window
showed
deal
bags
toys
'm
shows
teacher
prepare
older
firms
finish
lovely
kind
glass
everyone
results
completely
someone
looks
happy
future
choir
rings
high
employment
book
society
valley
passed
by
choice
direction
marked
minutes
two
province
ulsterbus
links
however
because
driving
example
selling
meat
supplied
villages
produces
problem
ends
conditions
crop
health
plant
settlement
complex
tyrone
red
halls
sports
area
news
support
leisure
hotel
patrick
salmon
begin
rich
unemployment
black
traditional
drama
figures
bigger
young
attractive
teenagers
members
dances
rent
bungalow
owners
repair
flat
much
paul
townlands
mountain
region
trillick
middle
sweets
post
district
dress
races
race
league
committee
players
fifty
team
successful
february
day
holy
adults
least
presented
programmes
ride
wheel
lying
turned
gets
shirt
quarter
breeds
surveyed
wash
residents
route
woodland
base
rev
university
stations
elected
unionist
parties
democratic
party
finished
darts
remain
meals
cereal
cases
eaten
controlled
rises
extensive
maintained
general
higher
slurry
march
roll
november
computers
wilson
providing
fertile
estate
barley
fodder
cricket
inhabitants
cricket
senior
domesday
information
mark
served
network
agricultural
28
washing
disused
rock
association
owner
dairy
present
include
still
community
work
--
usually
club
four
events
place
popular
see
grass
barley
mainly
presbyterian
towards
laid
o'neill
pigs
picnic
surrounded
campbell
derry
industrial
km
bathroom
concern
international
gortin
golf
track
riding
mum
dad
leaving
girls
m
g
talk
art
things
p.m.
raise
eggs
wheat
foyle
bit
city
coast
dungannon
unemployed
mummy
royal
city
journey
oil
coleraine
war
looking
units
looked
hoped
19
radio
hot
survey
educational
bay
white
adult
black
charge
six
station
caters
children
tend
child
rugby
donemana
churches
divided
potato
75
employing
peter
remaining
streams
breed
arable
400
dungiven
pitches
bowls
gravel
operation
2nd
friend
construction
considerable
principal
fun
flax
brian
portrush
watching
nice
institute
activity
designed
committee
b
estate
delivered
65
with
belfast
nature
return
developments
mary
position
joined
chips
only
raised
something
petrol
ancient
carry
ballygawley
bull
beach
portstewart
minor
gardening
vast
several
leading
sea
robert
items
associated
perhaps
rabbits
mrs.
permanent
stewart
newcastle
neagh
thomas
summer
armagh
separate
apples
brick
aughnacloy
cup
memorial
graham
banbridge
newry
folk
dwellings
limavady
show
larne
basalt
junior
=
?
edge
craft
straw
reserve
clubs
handicapped
man
active
bangor
kinds
shelter
*
motorway
youth
games
portadown
x
coalisland
downpatrick
magherafelt
m2
bann
ballymena
ballymoney
harbour
borough
holywood
bushmills
antrim
milford
_this
assembly
but
canal
250
ballycastle
recreation
olds
coagh
scottish
churches
ballymena
kilrea
clubs
cottages
eastern
crumlin
males
antrim
armoy
mourne
gilford
portadown
lurgan
species
scarva
randalstown
ahoghill
galgorm
lagan
shanes
ballyclare
hilltown
hillsborough
ballywalter
ravarnette
dunmurry
glengormley
newtownards
carrickfergus
ballyeaston
rd
drumaroad
comber
dundonald
greenisland
strangford
ards
kilroot
ardglass
